银联支付的申请已经受理，现在'测试接口'已经'可以用了'，等待技术接入。
'正式接口'文档资料流程'正在办理中'，申请完成后变更账号就可以了，
你们现在可以测试接入，技术调试了。
      
具体登录地址：
	'https://merchant.unionpay.com/join/'
暂时只能使用'IE浏览器'，需要'安装密码插件'。 登录这个地址，
点击'最上方登录'，'账户15817429670/ligu123456'，
这个账户由于目前'需要发验证码随时联系我'，所以目前是我'个人手机申请的'，
'后期可以变更为立咕专用邮箱'。
      '登录之后，选择我的产品'  

接入流程指导地址：
	'https://merchant.unionpay.com/join/help/director#' 

	
我们现在申请了'两个支付产品'，
一个是'二维码支付'，用于'商户端线下收银开场'出示'给用户支付'；
二维码支付:
	'https://open.unionpay.com/ajweb/help/file/techFile?productId=89'
	
另一个是'手机控件支付'，用于'客户端'预订场馆'在线支付方式使用'。
手机控件支付:
	'https://open.unionpay.com/ajweb/help/file/techFile?productId=3' 
详细情况请技术人员查看开发网页和文档，有任何问题随时联系我，谢谢大家。