前一段时间在帮公司'申请各种支付接口'，在'银联支付接口消耗了不少时间'，
其实'银联支付申请'还是'比较简单'的（不用上传app截图什么的），只是'申请入口比较难找'，
还有'填写的资料比较多'。下面我给大家介绍下'银联支付接口'中'手机控件支付申请'，
毕竟现在是移动互联时代，手机控件支付通过了，想增加其他支付如'网页支付'、
'网关支付'，'只需要补签一份意向书即可'，'不需要额外增加费用'。

银联支付申请入口：
	'https://merchant.unionpay.com/join/index,'

1.点击“'注册新用户'”，进入下图所示，按照提示进行'注册即可'。

2.'注册成功'以后就进入下图所示

3.'点击“产品大全”'，'进入“产品大全”页面'，
这里演示手机控件支付申请，所以我这里'点击'下图箭头所示的'手机控件支付'

4.进入下图所示，'点击“我要入网”'。提示：'这时可“我要测试”来下载对应的接口文档'，
'让技术员进行测试'，这样就'不会耽误开发进度'

5.'下载接口文档'进行'测试'，我这里就不演示了，你'也可以'走完入网流程'回来再下载接口文档'。
'点击“我要入网”'进入下图所示，选择你公司注册所在地。
	
收单机构：
	假如注册地是广东，就会有下面的3家收单机构可选择
'我这里选择''银联电子支付（广东）'，点击'“下一步”'，'进入“上传入网资料”步骤'，如下图所示

6.成功'上传完入网材料'就'等银联审核'，一般1-2个工作日，急的话可致电催下。
'银联审核和收单机构审核'通过后，就到'签订意向书'，这时我们'下载文档'，'按照文档上的提示填写内容'，
填写完后打印出来寄到文档上的地址，最后就等待对方的联系就行了。


