1，会员等级规则说明看这里：《成为陆金所VIP用户究竟有什么好处？》
2，陆金所的贡献值查询方法看这里：《陆金所贡献值查询方法》
3，e享系数是可以修改的，在账户后台的【账户安全】菜单的最下面有一个风险承受能力测试，重新测试之后将风险承受能力修改为“进取型”即可获得最高0.75的e享系数。
测试的时候，全部都选择风险最大和额度最高的选项，最后测试评分即为“进取型”获得0.75的e享系数。

所以，根据目前的规则，设：
G：可投入的'总资金量'
a：'每次申请e享的安e标的额度'
n：布局过程中需要'申请e享的次数'（杠杆布局完成，'一次还款''都还没有'过的时候'已经e享的次数'）
0.75：e享系数，也可以填写其他系数
x：杠杆率

可以推导出两个杠杆布局的等式：
公式1：(G+a*n*0.9)*0.75=a*(n+1)*a*0.9（等号左侧：'账户可e享的额度'，等号右侧：'杠杆需要的最大额度'）
简化为：n=(5G-6a)/1.5a

公式2：x=(a*n*0.9+G)/G
简化为：n=(x-1)G/0.9a

将两个公式合并，可获得
公式3：a=(20-5x)*G/18


根据规则，用上面的'3个公式计算出来的值'进行杠杆布局，是可以最大程度地'避开e享限额的影响'。
小伙伴们看到这些公式可能会发懵，不要紧，我们暂时只需要公式计算数值用于杠杆布局，消化理解可以慢慢来。
 

二，操作部分

1，计算a

由于之前我们已经'选择'过'x的大致范围'，'取'范围中'任意值输入公式3'，可'计算出a'，用'a即可进行杠杆布局'。
这里先提供一个工具：稳盈安e杠杆布局日程表（点击可下载），小伙伴们可以将上述公式计算出来的值代入计算表，可以得到详细的布局方案以及收益率，下面举例说明。

例1：

资金G=88万，杠杆率x=3.7，a和n为多少？

把x和G代入公式3，算出a=7.33万

把a和G代入公式1，算出n=36（完成布局需要申请e享36次）

由于我们开始投资稳盈安e+的时候，只能购买1万的整数倍，因此需要将a算出来的值变化一下：

取a=7，最终的杠杆率和收益率会比预设的值低

取a=8，最终的杠杆率和收益率会比预设的值高

将G=88，a=7或者8输入左上角的数值输入区，会出现如下图的结果：