'2.外地户籍少儿'：'在幼儿园或学校就读'，'父母一方'最近'三年之内'在深圳'正常交社会'保险'满一年以上'，需'两个条件同时具备'。
　　提供资料：
    1.'少儿'及'监护人'的'户口本'
　　2.'少儿出生证'
　　3.'父母一方'的'银行帐号'（无银行限制，存折或卡均可，建议中、家、工、建）以上三项需复印件
　　4.'小孩数码照回执'（写上'少儿的姓名'、'性别'和'身份证号码'，所有少儿都需要提供）
　　5.'在深居住'的'居委会开具'的《'计划生育证明'》（非深户提供，深户少儿不提供）
　　6.'父母一方是在编人员，需提供''未参加家属统筹医疗'的'单位证明'。
　　办理流程：
  【不在园】，'不在校''深圳户籍少儿'，由父母'在www.szsi.gov.cn申报'，申报'成功后'，将'资料交到社保站窗口''审核'。
　【在园】，'在校学生'由'学校在网上统一申报''学生姓名'和'身份证号码'，'申报后'，家长登陆www.szsi.gov.cn'申报家长信息'，
  申报'成功后'由学校'审核'并'打出审核单'，'盖章统一交资料''到社保站窗口'。（详情咨询：12333）
  
  	1.'深圳综合医疗保险'，只要是'在深圳工作'的，'任何人都可以办'，这个算'是一个'深圳的基本'福利待遇'，
'用于保障住院'，'看病'，'养老'等
  
	2.'非深户的居民'，'工作者'，可以'选择企业进行购买'，虽然'有一些不方便的地方'，但是'找工作的企'
业'进行购买综合医疗保险'，具体的'只要跟企业协商''就可以了'。
  
	3.要'购买综合医疗保险'，需要'准备个人的身份证'，'单位情况说明书'，以及'公司的社保缴费证明'，
办理'也可以交给企业'去'社保局进行申请'。
  
	4.另外，关于'综合医疗保险'的'缴费'，要求是'必须不能间断'的，也就是'必须要有持续性'，比如，
如果说'缴费了一段时间'，之后'综合医疗保险停止'缴费了，那之前'缴费'的就会清零。
  
	5.如果是换了公司单位，又没有及时缴综合医疗保险的，可以在三个月内进行补缴，但是，
如果超过时间比较长，那就需要重新计算时间，这个时候就会比较麻烦，得挂在另一家公司名下才可以买。
  
	6.总的来说，综合医疗保险人人都可以购买，只是深户的工作者可以自己购买，而非深户的工作者，
需要由企业进行代办购买，办理的时候，具体需要办理所需提供的资料可以咨询当地的相关部门。
  
	7.如果是换了公司单位，又没有及时缴综合医疗保险的，可以在三个月内进行补缴，
但是，如果超过时间比较长，那就需要重新计算时间
  
	8.综合医疗保险人人都可以购买，只是深户的工作者可以自己购买，
而非深户的工作者，需要由企业进行代办购买