Jmeter运行结果分析
'1.聚合报告'
'以上'就'是'我们所'关心的结果'

'Label'：'页面'或'请求名称'
'Samples'：'运行'的'线程数'（也可理解为请求数）
'Average'：'平均响应时间'
'Median'：'响应时间'的'中值'
'90% Line'：'90%的请求'响应'时间小于XX'
'Min'：'最小响应'时间
'Max'：'最大响应'时间
'Error%'：'出错率'
'Throughput'：'吞吐量'
'KB/sec'：以流量做

'2.察看结果树'
通过'察看结果树'，我们'可以看到''每个请求''的结果'，其中'红色'的'是出错的请求'，'绿色'的'为通过'。
'Thread Name'：'线程组名称'
'Sample Start': '启动开始时间'
'Load time'：'加载时长'
'Latency'：'等待时长'
'Size in bytes'：'发送的数据总大小'
'Headers size in bytes'：'发送数据的其余部分大小'
'Sample Count'：'发送统计'
'Error Count'：'交互错误统计'
'Response code'：'返回码'
'Response message'：'返回信息'
'Response headers'：'返回'的'头部信息'

'3.图形结果'
'样本数目'：发送到服务器的'总请求数'
'最新样本'：'服务器'响应'最后一个请求'的'时间值'
'吞吐量'：'服务器''每分钟''处理'的'请求数'
'平均值'：总'运行时间''除以'发送到服务器的'请求数'
'中间值'：有'一半的服务器响应时间''低于该值'而'另一半'的'高于该值'
'偏离'：服务器'响应时间变化'、'离散程度测量值的大小'
