"自动选择"距离开场"前五分钟和后十分钟的场次"

开场验证订单基本信息
"订单编号"，"时间场次"，"订单类型"，"用户信息"，"支付金额等"。

点击开场确认后开场，同步订单状态，场地状态，取消开场关闭本页面。


订单"点击开场验证""取消原来开场时间前后十分钟的限制"。


只要用户到达场馆，"可以随时开场验证"，但是"系统要等到真正的开场时间后"才
自动"改变订单状态"，"开始计时"直"到订单结束时间"。期间不需要场馆再次操作。



1 "线下预定"和"线下开场"两种订单，类型都"归为散客"。
2 "线下预定分为两个步骤"，预定，"收银开场"；  线下开场"直接收银开场"。
3 "线下预定订单的保留时间为开场前三十分钟"，"开场前三十分钟倒计时"
，此时商户可以主动取消订单释放资源。

唯一限制，'已预订订单'系统'自动取消'更'改为订单结束时间还未开场''系统自动取消'，
去掉其他限制。

6 手动取消或者系统自动取消的场次，状态又更改为可预订，继续走可预订流程。
7 线下预定订单预定后归为未开始订单，完成后归为已完成订单，取消订单后台不返回数据；
8 线下开场订单，正常支付开场后直接归类到已完成订单，取消订单后台不返回数据，统计数据归到散客里。


比如预定晚上8点到9点的场次，  那我就给你预留到7点30分，你还不来商户就可以主动取消掉。  商户没有主动取消8点10分系统会自动取消。

//TODO  退款需要写入交易流水。还要取林兵的时间

