1 有'时间限制'的'次卡'
	1.需求背景：'为'了'实现''有次数'+'有时间'限制的'套餐''能够重复''购买'的'功能'。 
	比如说'一个套餐'的属性是： '258 元， 60 次 一个月'有效期， '用完之后''可'以'重复购买'。
	2.'当月套餐'如果是'这个月 15' 号'用完'了，'用户又买'了一个，则'新套餐'的有效期是
	'从'这个月 '15' 号开始'顺延 30 天'
	3.由此可以创建'季卡'（'90 天'限制的次卡） 和'半年卡'
	4.该类套餐，'再上一个套餐''没用完之前''不能重复购买'，'和'我们'现有的次卡'是'有区别'的。
	
2 'app设置电动车'的'声音'
	2.1 '可'以'调整声音'的'大小'
	电动车的'音量有 9 个档位' 0-8， 做成'进度条拖拉'的控制方式， 完成'设置之后''发送'一个
	'指令给车辆'，'车辆'最好能'发声音'，让用户'知道当前'的'音量大小'
	2.2 '可'以'开关声音'
	或者，'音量调到 0' '就算关掉'。
	
3 电动车'低电量提醒'
	当'电动车'的'电量低于 30%'的时候，'发'送'通知给 app'，'提示电量过低'，'请尽快换电'！ 
	iOS需要发送苹果通知
	
4 '按群组' '开关换电柜/APP取/退电池'功能
	1. 'app'上把'预约取电池'和'扫码取电池'的'功能拿掉'
	2. '换电柜'把'退电池'的'按钮隐藏'掉
	3. '换电柜'把'可还电池的空仓数''隐藏'掉
	4. 'app服务网点'增'加可取电池'的'网点列表'和'退电池'的'网点列表'
	5. '可'以'根据群组''配置'该'功能'， 如果'该群组''不在该运营策略'只能则'保持和之前一样'
	
5 公告 app 端的功能

6 mini 换电柜适配