买房子本来是一件很开心的事情，而且也是一键让人自豪的事情。
不过如果有些步骤不注意好，那么买房中途会出现各种恼火和崩溃的事情。
小编就深受折磨的说。 我们'不光'是'要关注房子质量'、'口碑等问题'。 
'如果是按揭买房'。'贷款这个步骤''也是非常要注意的'。

'贷款注意事项'
'1前期准备'：
有的人可能工资不是很高，买房也大部分都是家里出的首付。
自己的银行流水账单可能不是很漂亮。'在你买房之前'。
最好是'做一个漂亮点的流水账'。 '每个月在银行卡里'面'存一点钱进去'。 
这样'就有了存款记录'！！会'增加你的审核通过率'！！
'银行流水账''是需要你贷款月供的两倍'！！有的银行超过5000要流水账。 
有的是不管多少都要。


'2贷款尽量贷整数'：
因为'银行贷款'都'是按照整数贷的'。不会贷到千位。 如果以侥幸的心里。 
想着会通过！遇到贷款放款紧的时候银行是很难放款的。所以条件允许。
'尽量贷整数'！比如'你要贷款32.5万'。'尽量只贷32万！！'


'3买房前尽量少辞职'：
如果'你的工作总是换来换去'。'贷款是很有难度的'！如果要买房了。 
尽量在一个公司呆着。 想辞职的都等到贷款下发之后在辞职！


'4尽量让开放商挑银行'
因为'如果是你自己挑的银行'。 如果'贷款没有下发'。 这'就是你的责任'的。
'如果是开发商挑的银行'。'贷款没下发' 。 还'可以逼着开发商帮你想办法'！！
如果贷款没下发， 就算追究责任， 如果是你自己执意挑选的银行。
开发商肯定是不会曾但任何责任的！！


'看房注意事项'
'1避免定金陷阱'：

'很多开发商'都'会打出多少抵多少的优惠活动'。 需'要缴纳多少钱定金'。
'有些开发商''定金还是会退的'。 '有的退的时候''就各种理由了'。
'所以如果交定金'。 '必须看好定金合同'！！而且中国文字。博大精深。
定和顶的意思虽然相近，但是差别就很大。所以'区别要分清楚'，'避免进了定金圈套！'


'2避免抢房陷阱'
'开发商总会制造一些抢房的氛围'。'让很多购房者''集中到一个时间段来一起抢房！'
这样'很多人为了抢到好的房号'。 就'会不加思考的去把房子抢到手'！
而且'很多开发商在抢房前一刻才公布房价'。 
所以'一定要计算好之后''在决定是否去抢'！！别勉抢到之后价格过高！！


'3观看房屋面积'：
'有的时候''看的样板间'，'是因为装修效果''会显得房子很大！' 
所以'看房买毛坯的''尽量拿未装修的房子做参考'！！


'4查看开发商口碑'：
'网上可以直接搜索这个楼盘怎么样'！ 
'或者'是'到搜房查找''看看这个开发商和楼盘''是否存在有维权的帖子'！
'甚至有的还有视频曝光的'。 '比如就可以在百度视频里面搜索楼盘''或者开发商名字'。
'避免买到黑心开发商的房子'！！


'5看五证'：
'开发商'要'有这五本证书''才有售房资质'！五证包括：
1、'《商品房销售（预售）许可证》'；
2、'《建设工程施工许可证》'；
3、'《建设工程规划许可证》'；
4、'《建设用地规划许可证》'；
5、'《国有土地使用证》'。


'签合同注意事项'
尽量'找有买房经验的朋友''和你一起去签合同'

'买房的时候''根本没时间去看合同'， '因为合同有很厚的一本'。 如果'一个个字去看'。 
'可能很少人有这种耐心'！！'所以很容易贝开发商钻空子'！！找买过房子的朋友一起去。 
这样可以找着重点看。 也避免一个人紧张！！


'退房协议要看仔细'：
'在买房贷款下发过程中'，'有的时候会出现很多争议'！而且'特别是购买期房'！
'在房屋建设当中''也会出现很多问题'。 
所以'退房协议那一栏'需'要看看开发商是怎么规定的'！！


'交房标准、交房时间'需'要看仔细'：
'交房标准'需'要看看合同上面是否又不符合要求的地方'！ 
因为'这是作为以后收房的最重要的依据'！ 而且'还需要看看交房时间如果超过'。
'开发商会做出什么赔偿'！


'赠送面积的猫腻'：
'有的房子会以赠送面积''做销售卖点'！ 可是'有的童鞋收房的时候'就发现
'实际面积比宣传的'时候'要小很多'。 小编买房的开发商就是。 
'说是赠送19平'。 '加上原有的104' 。 总共面积就'有123平'！
'除开公摊'最少也'有100多平'！！ 可是'实地测量只有85平'。 
然后'合同上'面'有出现了赠送的猫腻'！'这种时候'就等于'有理都说不清了'。
所以有赠送的一定要看清合同怎么写的。有利于以后维权！！

