1、查看五证，
所谓五证就是指《国有土地使用证》、《建筑用地规划许可证》、
《建筑工程规划许可证》、《建筑工程施工许可证》和《商品房预售许可证》。

2、买房其实选择口碑好的开发商很有必要。一般好的开发商资质高、资金充足。

3、评估购房能力，对于刚需族来说，由于他们的经济能力有限，
所以都会采取贷款的方式买房。而贷款每个月需要交一定数额的月供，
为了保证生活质量不受影响，避免断供的风险，
小编建议月供的数额最好控制在总收入的50%以内。

4、选户型，挑选户型时，首先要看户型的朝向。
朝向优劣的顺序依次为：正南、东南、东、西南、北、西。

5、选楼层，中间层房屋的空气质量相较于低层更好，
出行较高层更方便，可以说是折中。

6、很多购房者认为，当下房价过高，所以买房时，
一般会在同等区域、同等地段选择价位便宜的楼盘。
正确的做法是多学习选房知识，关注户型好坏，房屋质量等干货。

7、看优惠，对于开发商给出的优惠，要多打听，多分析，多判断，不要盲目追风。

8、莫心急，年轻人置业时，不宜好大喜贵，应抛弃置业必须一步到位的思想，
根据自身所能承受的范围，作出合理的决策。

9、不可一味买大，看房一定要综合考虑，不可片面。
首先是面积，面积以适用为原则，不可为大而大。

买房须知的18个常识 新手买房注意哪些坑

10、看规划，买房当然要挑楼盘，挑小区，挑户型，
但是也不能只看房子，还要看房子的位置。
毕竟，决定房子价值最大的因素便是地段，
建议在购置房产时，要切记紧跟城市发展的方向。

11、看价格，价格挑选比较个人承受范围、交通状况、
社区环境、户型结构等条件衡量楼盘价格。

12、小区环境，小区景观、绿化、
配套等与生活密切相关，更是楼盘质量的体现。

13、避免极端层，顶层和底层不建议买，
底层不仅容易潮湿，发霉，滋生蚊子，光线也不好，
顶层一到大夏天，不仅闷热，不透气，还容易漏水。

14、远离设备层，设备层是专门供水，供电的中间楼层，
要是常年居住在设备层的附近的话，
不仅机器设备的噪音把人折磨得无法休息，
连机器的辐射也会影响人的身体健康。

15、物业，不同的物业公司所做的服务千差万别，
物业公司能否尽善尽美地完成自己的任务牵扯到小区的整体质量。

16、考虑孩子问题，买地产要考虑孩子路上的安全问题，
尽量选择距离近的房子。这样可以给孩子节约大量的时间，
让孩子有充裕的时间学习和休息。

17、购房定金，定金对买受人是极为不利的，
使买受人在签约的时候处于不利的境地，
买受人往往在定金不退的压力下，违心地接受开发商的不平等条款。

18、签认购书，认购书基本条款要约定详细，
对所要购买的房屋的主要情况在认购书中予以约定。
条款内容约定要合法有效，
要求开发商提供作为正式签约的商品房买卖合同文本。

以上就是关于买房须知的18个常识以及新手买房注意哪些坑的介绍了，
其实买房的过程中要细细说来的话，注意事项和常识性的问题可不止这18个，
如果有自己亲手办理过买房手续，那就一定清楚买房流程的复杂性，
在办理房屋买卖手续的过程中最重要的还是要自己小心谨慎一些。

