本套课程将通过'分布式集群'和'分库分表'两部分内容进行讲解

1、主要'解决'针对大型'网站架构'中'持久化'部分'中'，大量'数据存储'以及'高并发访问'所'带来的'是数据'读写问题'。
分布式是'将一个业务'拆'分为多个子业务'，'部署在不同的服务器上'。'集群是同一个业务'，'部署在多个服务器上'。

2、着重对'数据切分''做了细致'丰富的'讲解'，'从'数据切分的'原理出发'，一步一步'深入理解数据的切分'，
'通过深入理解'各种'切分策略'来'设计和优化'我们的'系统'。这部分中我们还'用到了''数据库中间件'和'客户端组件'
来'进行数据的切分'，'让广大网友'能够'对数据的切分'从理论到实战都会'有一个质的飞跃'。

学完本套课程以后能够达到的效果：

期望通过本课程能帮助大家学习到'如何通过分布式'+'集群的方式'来'提高io的吞吐量'，以及'数据库的主从复制'，
'主主复制'，'负载均衡'，'高可用'，'分库分表'以及'数据库中间件的使用'。希望能够'帮助大家'更加'清楚了解架构'
的'工作模式'，从而写出更高质量的代码。对于企业的架构人员可以优化企业架构。对于兴趣爱好者，可以作为一个很好的入门。

课程讲解过程中尽可能用简单的语言描述其中的原理，通过实例来帮助初学者快速上手。案例中代码全部手写，
实例全部现场真实环境演示。

教程样例项目中用到的技术及相应的环境：
MySQL5.7  CentOS6.9  Vmware  Spring3.x以上  JDK8  Maven XShell Xftp

教程中所有的与编程相关均使用Java来进行演示，但与编程语言无关，可使用任何编程语言进行测试。