
选择'条件可以多选'，但同'类别的只能单选'。点击重置清空已选择条件，点击确认开始搜索，筛选按钮有提示。

交易记录

余额
操作：点击可切换'按余额'由'多到少'或由'少到多'排序


排序规则：
1、余额由多到少排序时
'折扣卡用户'按余额由'多到少排序'，显示在列表'最前面'，
'次卡用户'按卡内'余次由多到少排序'，显示'在折扣卡用户后面'，
'散客'和'新用户'余额'显示“-”'，暂'不排序'，显示在列表'最后'，
2、余额由少到多排序时
'折扣卡'用户按'余额由少到多'排序，显示在列表最前面，
'次卡'用户按卡内'余次由少到多'排序，显示在折扣卡用户后面，
'散客'和'新用户余额显示“-”'，暂不排序，显示在列表'最后'，


用户类型
'原用户类型'分为：'预定、会员、散客'
'现改为'：'会员：已办会员卡的用户'
'散客'：在该场馆有过'消费记录'但'未办会员卡'的用户
'新用户'：还未在该场馆'有购买或消费记录的用户'，消费后用户类型自动变更。
如'领过代金券'还'未消费'过的用户，或者通过其他手段'收集到用户信息'录入场馆
但'未有过购买或消费'记录的用户，都属于'新用户'
