按键精灵安卓版教程听语音
|浏览：11108|更新：2014-07-29 09:52|标签：安卓 
按键精灵安卓版教程1按键精灵安卓版教程2按键精灵安卓版教程3按键精灵安卓版教程4按键精灵安卓版教程5按键精灵安卓版教程6按键精灵安卓版教程7
分步阅读
按键精灵这款软件可以模拟手动实现屏幕点击，滑动，图色识别等操作，可以真正的让童鞋们放飞双手，轻松的游戏。

方法/步骤
在安卓手机安装好按键精灵以后，点击图标启动程序，进入软件脚本列表界面。
按键精灵安卓版教程
按键精灵安卓版教程
点击右上角图标或者在屏幕上向左滑动，切换到功能菜单列表。点击最上面的第一项进入用户登陆界面。如果没有用户名，可以点击右下角的【注册账号】，进入注册界面，输入用户名，密码和邮箱，点击立即注册。
按键精灵安卓版教程
按键精灵安卓版教程
按键精灵安卓版教程
按键精灵安卓版教程
回到功能菜单，点击【热键设置】可以进行物理按键和虚拟浮窗的控制；点击第三项【软件设置】，可以进行三项开关控制，包括来电是否停止运行脚本；是否自动检测更新；摇一摇是否停止脚本运行。点击下方的【检查更新】按钮可以查看更新的连接。
按键精灵安卓版教程
按键精灵安卓版教程
按键精灵安卓版教程
点击【关于】菜单，可以查看当前安装的软件版本，是否需要更新。
按键精灵安卓版教程
5
回到脚本列表界面，在屏幕向右滑动，或者点击左上角的图标，打开分类管理界面，这里可以进行类别的新建和管理操作。
按键精灵安卓版教程
按键精灵安卓版教程