实验楼切换到root用户 'sudo -s'

1.物理机系统上可以通过使用[Ctrl]+[Alt]+[F1]～[F6]进行切换登陆，当切换到
其中一个终端后想要切换回图形界面，可以按下[Ctrl]+[Alt]+[F7]来完成

2.'echo'可以用来打印字符串

3.'tab'可以补全命令，补全目录，补全命令参数

4.'Ctrl+c'键强制结束当前命令

5.'tail'可以进入显示输入内容的界面并且不会执行输入的命令

6.'find'可以用来查询内容

7.Ctrl+d 键盘输入结束或退出终端 Ctrl+s 暂停当前程序，暂停后按下任意键恢复运行 
'Ctrl+z 将当前程序放到后台运行，恢复到前台为命令fg'
'Ctrl+a 将光标移至输入行头，相当于Home键'
'Ctrl+e 将光标移至输入行末，相当于End键'
'Ctrl+k 删除从光标所在位置到行末'
Alt+Backspace 向前删除一个单词
Shift+PgUp 将终端显示向上滚动 Shift+PgDn 将终端显示向下滚动

8.使用键盘上的方向上键，恢复你之前输入过的命令

9.通配符是一种特殊语句，主要有星号（*）和问号（?），用来对字符串进行模糊匹配
（比如文件名，参数名）。当查找文件夹时，可以使用它来代替一个或多个真正字符

10.'touch 可用来创建文件'，用touch No.{1..10}.txt 可创建10个连续命名的文件

11.使用man来查看手册，--help来查看帮助