报名赛事(同时生订单)
PUT /biggame/{id}/join
入参
head X-Request-Token
path id
body {siteId:"",playerIds:[""]}
返回
{
    "status":1,
    "tip":"",
    "code":0,
    "data":{
        "orderNo":"",
        "facePrice":0
    }
}
//示例入参
path id = 2
{
    "siteId":"1",
    "playerIds":[
        "cd6bbe92a7d14a19b561",
        "cd6bbe92a7d14a19b567",
        "cd6bbe92a7d14a19b568",
        "cd6bbe92a7d14a19b569",
        "cd6bbe92a7d14a19b570",
        "cd6bbe92a7d14a19b571",
        "cd6bbe92a7d14a19b572",
        "cd6bbe92a7d14a19b573",
        "cd6bbe92a7d14a19b574",
        "cd6bbe92a7d14a19b575",
        "cd6bbe92a7d14a19b576",
        "cd6bbe92a7d14a19b577",
        "cd6bbe92a7d14a19b578",
        "cd6bbe92a7d14a19b579",
        "cd6bbe92a7d14a19b580",
        "cd6bbe92a7d14a19b581"
    ]
}

需求：
	'为确保'本次'比赛顺利进行'，每个'参赛队伍''需交纳押金'，比赛'结束后'，
	'押金'将'在1-7个工作日'内'退回原账户'（节假日顺延）。
	1,'报名'需'缴纳5000元押金'
	2,'立即支付'调起'支付App完成支付'
	'支付取消''回到此页面'，
	支付失败则toast提示支付失败，请重新报名，回到赛事信息页面


确定
格式：（已勾选人数/报名限制人数），
说明：
	1、'已勾选人数范围'为'最小为2'，'最大为报名限制人数'。
	2、'勾选人数未达到报名限制人数'时，按钮置灰，'不可点击'
	3、提交时要再验证一下'所选球员'的'球号是否有重复'，若有'重复则无法提交'
	【球员球号有重复，请重新修改后提交】
	操作：点击弹框提示确认是否提交
	
	成人赛/青少年U11  有15人
	青少年U9 有10人
	
	比赛类型
	赛事站点
	人员
	
	1，站点队伍是否名额已满
	2，改球队是否已报名
	3，报名人数是否足够【必须选'满15人'；'队长和教练必选'】；
	4，判断人员球衣是否重复；
	
	
	
订单回调：
*************逻辑*************订单支付、让球队报名成功的处理

