'比赛阶段'-由'成人赛事'进入'发布赛程'，'显示预选赛'、'正赛'、'决赛'三项
由'青少年赛事'（'U9或U11'）赛事'进入发布赛程'，只'显示正赛'、'决赛'两项

选择'预选赛'的时候才'显示比赛的16个站点'，其他阶段不显示

'预选赛'tab下，'显示'：'A组小组赛'、'B组小组赛'，'分站赛'
'正赛'tab下，'显示'：'小组赛（ABCDEFGH组）'、'16进8淘汰赛'，'8进4淘汰赛'
'决赛'tab下，'显示'：'半决赛'、'季军赛'、'总决赛'
下拉显示'所有报名球队'，按球队名称'首字母顺序排列'，含'搜索功能'
可选'24小时内'的'整点和半点时间'

{
    "bigGameId":"1",
    "fbMatchTeam":{
    	"teamId1":"2Z03ePu11223344cG",
    	"teamId2":"2Z03ePu11223344cG1",
    	"address": "广东省深圳市南山区",
    	"venueName": "流鸿钧",
    	"startTime": "2018-01-07 15:32:00"
    },
    "siteId":"2",
    "stage":1,
    "type01":1,
    "type02":1
}