这张图只是一个大致的范围，用于帮助本篇内容的理解。旅游意外险没有加进去，是因为分类的标准略有不同，
而且基本保障是类似的，主要区别在于附加服务，所以本篇暂不讨论，找机会开篇另写。

一、啥是意外险？
'意外险'最关键的概念，就是保障责任中的'事故'，都必须'是意外导致'的。而不同种类的意外事故，则产生了不同种类的意外险。

'意外伤害事故'：指'外来'的、'突发'的、'非本意'的、'非疾病'的使身体'受到伤害'的'客观事件'。

老王好好的走路，结果'踩到香蕉皮''滑倒'，摔骨折了，这个叫意外事故。
老王好好的走路，被'突然冒出'来的'自行车'给'撞骨折'了，这个也叫意外事故。
但如果老王是突然'心梗发作'，摔倒'骨折'，那这个就'是疾病导致'的，而'不是意外事故'。
老王在38度高温下走路，'中暑跌倒'，'摔骨折'了，这个也'不是意外事故'。
老王真可怜。

按照不同的发生意外的原因，'意外险'有'很多'的'种类'。它们彼此之间的关系，既可以是包含的，也可以是有重叠的。
比如公共交通意外险，就包含了航空意外、火车意外、轮船意外、公共汽车意外、出租车等营运车辆造成的意外事故，
只要你是作为乘客花钱买票坐这些交通工具，就在保障范围内。

但如果是航空意外险，那就只管坐飞机造成的事故啦。

同样，电梯险就只管坐电梯出现的事故了。

保障内容相对最全面的意外险，是'综合意外险'，'除了免责条款'里'那些内容'，'不'会特别'限制意外'的'原因'。

当然，在同样保额的情况下，事故原因的范围越大，种类越多，几率越大，保险的费率一般也就越高。

二、'意外险'的'保障责任'
﻿核心三大类：'意外身故'+'意外伤残'+'意外医疗'。
-意外身故-
'意外身故'，以生命为标的，'被保'险'人'因为'意外去世'了，一次性赔付保额。这个好理解，关键是事故原因清楚。
意外身故的三大特点：
杠杆高。10万保额的综合意外身故，一年的保费只要几十块钱。而600万的航空意外险，一天的保费只要2块钱。秒杀其他险种。
没有等待期。一般保障的生效时间，都是投保成功后的几天内。有些航空意外险，甚至当天投保都可以生效。
无需健康告知。	投保意外险的时候没有健康告知这个要求，一般只对年龄和职业有限制。
有些产品会要求被保险人是「有完全民事行为能力及生活自理能力的自然人」。
这个标准不是很具体，有特殊情况的，自己衡量一下，或者打客服咨询一下为准。
而且意外身故也是一种给付性的寿险，属于基本必备的保障。和其他的寿险、意外险保额基本不冲突，都可以重复赔。

-'意外伤残'-
意外伤残是很特别、也很容易被忽略的一种保障，非常值得好好说一说。
意外伤残的条款一般是这么规定的：
「伤残标准规定了功能和残疾的分类和分级，将人身保险伤残程度划分为一至十级，
最重为第一级，最轻为第十级，与人身保险伤残程度等级相对应的保险金给付比例分为十档，
伤残程度第一级对应的保险金给付比例为100%，伤残程度第十级对应的保险金给付比例为10%，每级相差10%。」
说白了，'人没死'，但是'达到了伤残级别'，就'按照伤残的等级'，'赔一定的比例'。
1级伤残-100%
2级伤残-90%
3级伤残-80%
……
8级伤残-30%
9级伤残-20%
10级伤残-10%

老王有100万意外保额，某天发生了车祸。
老王当场去世——赔付100万。
老王颅脑损伤导致植物状态，属于1级伤残，赔付比例100% —— 赔付100万。
老王双手完全丧失功能，属于4级伤残，赔付比例70% —— 赔付70万。
老王一侧耳廓缺失，属于8级伤残，赔付比例30% —— 赔付30万。
如果以上几种伤残同时出现，按最重的那个赔。
这里定残一般有个期限，意外伤害'事故发生之日起180日内'。如果第180天治疗还没结束，就'按第180天的伤残情况'进行'伤残鉴定'。
所以，如果老王对自己够狠，就可以先别好好治，保持一个半死不活的状态，捱过半年之后定残，拿更多的理赔，然后再治回来。（我敢胡说八道，你敢信吗？）
这个伤残，不是我们想象的，一定要严重到断手断脚这一类的才叫伤残，
很多身体部位的缺失，和功能的缺失，都可以是伤残。具体的伤残标准，
大家去搜索一下 人身保险伤残评定标准 ，可以说是很详细了。

为什么说意外伤残很重要，看完上面的伤残标准你就能看出来，因为'意外事故造成'的'健康损伤'，
很多是'达不到重大疾病'标准的，但是'事后持续的康复'过程和'误工成本'，乃至'对整个人生的影响'仍然'不低'。
而'不管是意外医疗'还是'其他医疗'险的报销，都'只是补偿原则'，'不产生额外'的'现金流'。
这个时候，意外伤残能给到的给付性赔偿金，有几万到几十万，甚至上百万不等。
能解决很大问题。
因为伤残标准和比例都是固定的，所以到底能赔偿多少，就要看意外身故的保额是多少了。

-'意外医疗'-
意外医疗又包'含'了'门诊医疗'、'住院医疗'、'住院补贴'几类保障内容。
'门诊医疗'和'住院医疗'，都'是补偿性质的'，往往也'是放在一起'，'共用一个保额'。这里有几个点需要注意：
'时间限制'：很多'意外医疗险'规定，只'赔付意外伤害事故'发生之日起'180日内'（含第180日）的'医疗费'用。并不是没完没了的赔下去。
'赔付额度'：不会特别高，'1-2万'是'最常见'的，偶尔有5万、10万的，也会贵不少。

'赔付范围'：分 '社保范围内'／'不限社保' 两种。后者肯定比前者贵。
'免赔额'：常见的是100元免赔额，也有0免赔额的，后者肯定更贵。
'赔付比例'：常见的是100%和80%，具体的以条款为准。
'住院补贴'，就是在报销的基础上额外给的现金了。一般按天给，50-100块／天，最多给多少天，免赔几天，也会有具体规定限制。

这么多因素，该怎么选，更多的是个人的喜好和选择，但关哥还是要提醒一下，一定要'抓大放小'。

我在掌握这5个原则，买保险不用再纠结这篇里强调过，「买保险不是为了占便宜，羊毛可以薅，但别因小失大。
保险这个东西，凡是你希望买了就能用到的，解决的肯定不是你承受不了的风险，大都是补偿一点经济损失而已」。
正是因为意外医疗的保额不会特别高，所以不论免赔额是0还是100，赔付比例是80%还是100%，
甚至报销范围是社保内还是不限，对家庭经济的影响，都不会特别大。总共也就是一两万的事情。更多影响的是理赔的感受。
比如免赔额这件事，有很多意外险会把0免赔额作为重要卖点，也有很多人会很在乎这100块。
但实际上一方面，免赔是0的产品，保费成本肯定要高一些，另一方面，如果赔付小于100块，
你可能都懒得走赔付流程，而如果赔付达到几千元，其实也不差这100块了。
但是如果是比较大的治疗费用，意外医疗本身也未必够用，这时候就需要百万医疗险、意外伤残、甚至重大疾病等保障来承担经济上的负担了。

保险啊，从来都不是只看单一产品的。

-猝死-
猝死比较特别。实际上「'猝死'」是'疾病导致''的身故'，只不过特点是突发，
看起来有意外的特点。所以绝大'多数意外险中'，'「猝死」'是'不属于保障责任'的。
但总有些产品喜欢瞅准这种市场机会，制造卖点。毕竟熬夜成性的加班狗还是很多的。
比如众安的「全年奋斗无忧意外险」、平安的「百万综合意外险」、国华人寿的「50万综合意外及猝死险」都包含猝死责任。
当然，条款对于猝死的定义也一定有相应的规定，比如要在6小时或者24小时以内身故，一定要认真阅读条款。

