1 '套餐调整'

1.1 '增加套餐''可以重复买''的''次数功能'		--->周期？
1. '管理后台'，'创建套餐的页面'，'增加一个''可以设置重复买次数的选项'
2. '设置之后'，'该套餐的有效期以内'，'可以重复购买多个套餐'，但是'不能超过上限'
3. '购买的多个套餐'，'有效期自动延后'，
'比如说一个套餐的有效期 30 天'，'次数 30 次'，
'无论是次数用完'了'或者超过有效期''都能用下一个套餐'。

1.2 '套餐页面微调'		
目前的设计，如果'套餐名字'或者'套餐说明过长'都'会出现显示不完整的情况'。
把'套餐说明''移'动导卡片的'底部'，'单独一行'。

2 '增加''扫电柜 SN ''换电功能'
'目前屏幕上的二维码格式如下：'
http://download.immotor.com/app/downloads/ehuandian?pid=f08b8c5a03623c
由于白天屏幕反光，很多用户扫码扫不上。后面'会在换电柜'上'贴上电柜 sn 二维码'，
格式如下
http://download.immotor.com/app/downloads/ehuandian?sn=STA601800010

'APP 扫描上来'之后，'根据 sn/pid' 字符来'判断'扫描上来的'是 SN 码还是 PID',如果是
'SN 码'需要'去后台请求相对于的 PID'. 后续的流程不变！

3 '换电柜详情'页面
1. '小助手可'以'上传多张换电柜'的'图片' 3-5 张
2. '后台管理系统'也'可以上传换电柜的图片'（以后）
3. '地图页面点击换电柜'，'从下方的地理位置''进入换电柜详情页面'

'换电柜详情页面'：
1. '上方展示''换电柜图片'，可以左右滑动，点击可放大
2. '换电柜地理位置'
3. '柜子编号'
4. '当日换电单数'
5. '换电高峰期'，'从昨天的换电单身曲线里面去前三个值'
6. '48v 的电池个数'
7. '60v 的电池个数'
8. '空仓数'
9. 下面是'昨日换电时段''分布图'
'把之前预订之后''换电柜图标展示图片拿掉'， '点击下面的导航'，'弹出地图选项'。
4 UI 调整
1⋅ '我的车辆页面调整'
2⋅ '我的电池'->'租电池弹框'
