公积金涉及到买房，提前知道自己公积金可以贷款的额度，
能够提前做好准备，那么怎么计算自己的公积金能贷多少钱呢，小编手把手教您。

'首先'需'要了解当地'（一般以市为单位）的'公积金贷款政策'，
小编以'杭州市为例'，2015年11月1日起，公积金贷款政策发生变化，
'从'原先的'月缴存数量确定''到''12月内''月平均余额确定'，
'具体数目为''过去12月''平均余额*12'，'不足15万按15万'计算，'大于50万按50万'计算。

另外，需要注意的是，'在贷款之前'，无论是商贷还是公积金贷款，
都需'要核实自己'的'征信'是否造成，如果'征信不达标'，那么很有'可能不批准'，
就算批准的话'利率也较高'，下面是如何查询自己的征信报告，供参考。

怎么样'在网上查询自己的''征信报告信息'

额度计算
首先，'到当地公积金网站''查询''自己的公积金账户余额'，以及'每月缴存的公积金数额'，
如小编查询到是'每月缴纳516元'，'余额为11814.71元'，如下图所示。

那么如果'小编要买房'，而且'征信什么都没有问题'，想要一个人贷款，
那么过去'12个月'的'月均余额为'为（11814.71+516）/2=9003.355，
那么'个人额度为'9003.355*15=135050.325元，不足15万，那么可贷额度就是15万。

当然，现'在公积金网站''查询都做的非常详细'，
进入到点击'左侧查询业务中'的'贷前咨询选项按钮'，如下图。

然后在'右侧显示贷前咨询页面'，'若夫妻双方贷款'，则'填上配偶的信息'，
接着'在开发商'、'房屋总价'、'贷款年限'等空白位置'填上具体信息'，
点击'底部的额度计算按钮'。

最后，'在下放额度贷款公式中'自动'显示可以贷款的额度信息'。

若有帮助，甚是荣幸
每年7月份公积金月缴额度会调整