小米手机系统是MIUI系统，目前是两个版本，一个是开发版，一个是稳定版。
故名思意，稳定版就是系统比较稳定的，而开发版本则是每周都会更新，
都会修复bug或者增加抢先体验的新功能，也可以说是root版本，
root大家就更加理解了。小编介绍的方法是不需要清除手机应用数据的。
比较方便。下边介绍一下如何root小米手机吧。

MIUI'开发版安装包'
小米手机（该方法'对所有小米手机有用'，'小米2'，'小米3'，'红米及Note……')
使用的是'卡刷MIUI完整包'，所以'升级不需要清除数据'，'会保存目前的应用数据'

进入小米官方网站后，在'首页菜单'即可看到【'miui'】

进入MIUI介绍页面，在最低端有个'MIUI开发版链接'，
这个一般是最新版本的更新日记链接，点击链接进入论坛


准备工具：

小米手机一部。

数据线一根。

电脑一台（windows7或者windows10系统 只限于线刷时进行使用）

由于'部分手机的稳定版是安卓6.0系统'而'开发版是安卓7.0系统'，
因此为大家'提供一些安卓6.0的卡刷包'：

'红米note 4X'    '7.4.6 开发版'
'稳定版''不可直接刷'入最新'开发版'，需要'先刷入以上版本'

卡刷方式：
第一步：'下载开发版刷机包'。
第二步：点击图片上的右上角。
第三步：点击'手动选择安装包'。
第四步：找到'安装包进行选择'。
第五步：正在解密。
第六步：选择“'同意擦除'”。
第七步：点击“'检查更新'”页面即可'收到MIUI9推送'。
第八步：更新完成。（如下图）


在这我们教一下大家如何给bl上锁
1.'首先下载BL上锁工具'（工具在附件里，此工具来源于网络，作者:jiajieit）

2.打开文件名为BL上锁.bat的文件

3.将手机关机，按住音量减加电源键进入fastboot模式，然后连接电脑。然后按任意键进入下一个界面

4.解锁成功是会显示OKAY,然后手机会自动重启

教程到此结束，希望小白们认真看完本帖再去动手操作。
最后希望觉得本帖好的可以点个赞，回复回复，同时也谢谢大家的观看。


按下面所述步骤进入fastboot模式：

1.首先你需要安装官方的USB驱动，并关闭手机

2.同时按住音量下+开机键开机
  按住不放直到显示米兔画面后松手

3.屏幕会始终停留在米兔LOGO界面

4.完成上述步骤，将手机连接到电脑,按任意键继续

--如果不想重新锁上BL锁请关闭此窗口！
