'报销范围'和'报销比例''每个地方'都'有所不同'，'具体'的报销'比例'和'范围'要'具体问'一下
'参保病人户籍所在地'的'乡镇医院'去'咨询'。

'自行就医'('未指定医院就医'或'不办理转诊单')、'自购药品'、'公费医疗规定不能报销'
'的药品'和'不符合计划生育'的'医疗费用';'车祸'、'打架'、'自杀'、'酗酒'、'工伤事故'、
'门诊治疗费'这是都'是不能报销'的，'只有住院治疗''才能进行费用报销'。当然'不是'
'所有的费用'都'可以报销'，'只能报销一部分'哦。

'参保地'的'乡镇医院'费用'报销比例'是'最高'的，'卫生院报销60%';'二级医院报销40%';
'三级医院报销30%'。如果要'到参保地'的'地级市以外'的医院治疗，需'要参保地乡镇'、
'县级'、'地级'的'三级相关医院''出具转诊证明'，'再到其他地方去治疗'，'才能报销费用'。

当'住院时'一定要'和医生说'自己是'办了农保'的，这样'才会'为你'办理相关'的'手续'。
'出院'的'时'候，一定'要记得索要病历本'、'医药费清单'、'住院发票'、'出院记录'
'等报销'所需的'凭证'，并妥善保管哦。

'报销时'，一定要'找到正确的报销部门'哦。

在'参保地住院治疗'话，在'出院时'他'就会给你报销'了。在'参保地外住院'治疗就'要'
'拿'着'身份证等'相关'资料''去参保地''报销'。