这里我会跟大家一起利'用''老毛桃软件制作U盘启动盘'和'安装ghost win7系统'。

'需要能'够'解压镜像文件'的'软件'，如'Deamon tool'或者'UltraISO和''win7'的'镜像文件'

1首先去官网'下载'一个'老毛桃启动制作工具'

2'下载UltraISO软件'，

3'下载Win7操作系统的ISO文件'

4'打开'刚刚安装的'U盘启动制作工具'，并'插上'您的'U盘'，'点击'下面的'一键制作成USB启动盘'，
等待'数分钟之后'就'做成'了，然后'它问'您'是不是'需要运行'模拟一下'，这里可以点击模拟，也'可不模拟'。

5由于'u盘格式''默认'为'fat'格式，'不能'够'复制大文件'，而'系统镜像'往往'是大文件几个GB'，
因此'需要'将其'转化为NTFS'格式，'点击"NTFS"'.

6这个时候您的'启动盘'已经'制作完成'了，您会发现的'U盘名字'已经'变成'了'老毛桃U盘'，
且打开U盘会发现里面'多出两个文件'，但这仅仅是安装系统的第一步，算是砍柴前磨刀步骤

7'用UltraISO'软件'打开'你的'win7镜像文件'，'找到'里面最大的一个'win7.GHO文件'，
并'将其提取到''U盘'里'的GHO文件'中。

8这时'将'制作好的'系统盘插入'要装的'电脑'上，开机时要'进入BIOS'设置'界面'，不同的机型不一样，
大家可以去搜一下，有些机型在开机时左下角会显示告诉你按什么键进入BIOS界面，
这里我的是联想的一款笔记本，开机按F2键可以进入。'进入之后''点击'第一个选项'运行老毛桃 Win8PEx86精简版'

9然后会'出现如下界面'，'等待一会'便会'进入老毛桃PE界面'。

10接着我们要'开始系统'的'安装'，我们'默认第一个分区'进行'安装'。
'一切'选择'完毕''点击“确定”'之后会'弹出'一个'提示窗口'，'点YES'就行了

11'之后'开始'系统文件自动开始解压'，我们耐心等待，'解压完了'之后，
它会'自动重启'。

12'重启之后'这个时候，'界面就变成'可爱的'win7界面'啦，然后静静的'等她安装完'，
下面有进度条显示。

这里安装的是ghost win7系统不是原版win7系统哦