'微信公众平台'已逐渐被媒体（自媒体、媒体）、企业、团体等重视，
纷纷开发自己的公众平台，最近又注意到'微信开放平台有，
'微信商户平台'，类似于APP，究竟他们'有什么区别'

介绍
一.微信'开放平台'
主要'面对''移动应用/网站应用开发者'，为其'提供微信登录'、'分享'、'支付'等'相关权限和服务'。
微信开放平台还提供了数据统计功能，用于开发者统计接入应用的登录、分享等数据情况。

接入步骤
已京东APP举例，比如京东APP需要使用微信登录、分享和微信支付功能，'首先注册'微信'开发平台-开发者账号'，
并按照以下流程'在'微信'开放平台''创建京东APP'：
审核通过后，即可获得以下的初级权限，如'要获得更高'如微信'支付权限'，需要'再单独申请'，
具体微信'支付权限申请步骤'详'见附件《移动应用-微信支付权限申请流程》'

二.微信'公众平台'
微信公众平台'用于管理、开放微信公众号'（包括订阅号、服务号、企业号），
简单的说就'是微信公众号'的'后台运营、管理系统'。

后台功能（以服务号介绍）
（1）基础运营功能：公众号申请成功后即可获得群发功能、自动回复、自定义菜单、投票管理；
（2）高级功能：微信公众平台还提供了以下高级的功能来丰富公众号，以下权限需要二次开发。
（3）微信支付：提供公众号内微信支付能力，和移动应用一样也需要单独申请，流程和移动APP流程类似。
（4）管理：包括已关注用户管理、消息管理、素材管理
（5）推广：包括广告主（定向投放广告，精准推广自己的服务）和流量主（按月获取广告收入）
（6）统计：用户分析、图文分析、消息分析、接口分析（自定义菜单调用量）

三.'商户平台'
无论是申请 '公众平台'商户 还是 '开放平台'商户，申请成功后，'都会拥有商户平台'账号，可登陆商户平台进行操作。

 '商户平台'主要就是'做微信支付'用的，如果'APP或者公众号'需'要接入支付功能'，
那么就'需要在公众平台''申请''公众平台商户'，'或者'在'开放平台'申请'开放平台商户'。申请成功后会分配商户平台账号。
